#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_service_versions.aks_version will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_kubernetes_service_versions" "aks_version"  {
      + id              = (known after apply)
      + include_preview = false
      + latest_version  = (known after apply)
      + location        = "eastus"
      + versions        = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azuread_group.aks_admin will be created
  + resource "azuread_group" "aks_admin" {
      + description             = "Azure AKS K8s administrator for azure-sample-dev cluster."
      + display_name            = "azure-sample-dev-administrator"
      + id                      = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
    }

  # azurerm_kubernetes_cluster.aks_cluster will be created
  + resource "azurerm_kubernetes_cluster" "aks_cluster" {
      + dns_prefix              = "azure-sample-dev"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = (known after apply)
      + location                = "eastus"
      + name                    = "azure-sample-dev-cluster"
      + node_resource_group     = "azure-sample-dev-nrg"
      + private_cluster_enabled = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "azure-sample-dev"
      + sku_tier                = "Free"

      + addon_profile {

          + azure_policy {
              + enabled = true
            }

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
        }

      + default_node_pool {
          + availability_zones   = [
              + "1",
            ]
          + enable_auto_scaling  = true
          + max_count            = 1
          + max_pods             = (known after apply)
          + min_count            = 3
          + name                 = "default-pool"
          + node_count           = (known after apply)
          + node_labels          = {
              + "app"           = "system-apps"
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 10
          + os_disk_type         = "Managed"
          + tags                 = {
              + "app"           = "system-apps"
              + "environment"   = "dev"
              + "nodepool-type" = "system"
              + "nodepoolos"    = "linux"
            }
          + type                 = "VirtualMachineScaleSets"
          + vm_size              = "Standard_F2"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + linux_profile {
          + admin_username = "ubuntu"

          + ssh_key {
              + key_data = (sensitive)
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + managed                = true
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = "az_admin"
        }
    }

  # azurerm_log_analytics_workspace.insights will be created
  + resource "azurerm_log_analytics_workspace" "insights" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "eastus"
      + name                       = (known after apply)
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "azure-sample-dev"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + workspace_id               = (known after apply)
    }

  # azurerm_resource_group.aks_rg will be created
  + resource "azurerm_resource_group" "aks_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "azure-sample-dev"
    }

  # random_pet.aksrandom will be created
  + resource "random_pet" "aksrandom" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_cluster_id                 = (known after apply)
  + aks_cluster_kubernetes_version = (known after apply)
  + aks_cluster_name               = "azure-sample-dev-cluster"
  + azure_ad_group_id              = (known after apply)
  + azure_ad_group_objectid        = (known after apply)
  + latest_version                 = (known after apply)
  + location                       = "eastus"
  + resource_group_id              = (known after apply)
  + resource_group_name            = "azure-sample-dev"
  + versions                       = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @hpettenuci, Action: `pull_request`, Working Directory: `./terraform/`, Workflow: `Terraform Plan`*